# Режим разработки
TestMode = True



# Переменные для подключения к клиенту
session_name = 'AmberTime_bot'
api_id = 1209411
api_hash = '32583db8454ca7feb52a4a5d48289519'

# Переменные чатов
if TestMode == True:
# Чат в котором реагируют триггеры лавки
	echo_chat_id = 'My test group'
# Диалог ЛС в котором реагируют крафт-триггеры
	echo_chat_id_im = 394557686
# Чат в который приходит ответ на триггеры лавки
	chat_id = 'mytestgroupqwerty'
# Диалог ЛС в который приходит ответ на крафт-триггеры
	chat_id_im = 394557686
# Бот Chat Wars
	CW_chat_id = 265204902


else:
# Чат в котором реагируют триггеры лавки
	echo_chat_id = '🌳Терновый Куст'
# Диалог ЛС в котором реагируют крафт-триггеры
	echo_chat_id_im = 7813495
# Чат в который приходит ответ на триггеры лавки
	chat_id = 1306127576
# Диалог ЛС в который приходит ответ на крафт-триггеры
	chat_id_im = 7813495
# Бот Chat Wars
	CW_chat_id = 265204902